"""Логово данных."""

#  8888888b.         d8888 88888888888     d8888
#  888  "Y88b       d88888     888        d88888
#  888    888      d88P888     888       d88P888
#  888    888     d88P 888     888      d88P 888
#  888    888    d88P  888     888     d88P  888
#  888    888   d88P   888     888    d88P   888
#  888  .d88P  d8888888888     888   d8888888888
#  8888888P"  d88P     888     888  d88P     888


MSG_REGISTRY = {
    "01_hello": "Добро пожаловать в игру! %p Я буду вашим ведущим",
    "02_name": "Как вас зовут?",
    "04_00_maxp":
                """%s, теперь введите максимальное число очков. %p Победит тот,
                кто наберет столько же или больше""",
    "04_01_errint": "We need a int",
    "04_02_errval": "Bad idea, do it again",
    "05_start": "Великолепно! Начинаем игру!",
    "06_whoturn": "%s, твой ход",
    "07_scoreturn": "%s, твои очки за ход: %s",
    "08_scoretot": "%s, всего ты заработал: %s",
    "09_scoreearn": "%s, ты заработал %s очков",
    "10_nodice": "Нет ни одной комбинации!",
    "11_baddice": "Некоторые кости не принесли вам очки",
    "12_badpick": "Вы не можете выбрать эти кости!",
    "13_enemy": "Ваш противник - робот по имени %s",
    "14_robpick": "Робот взял эти кости:",
    "15_00_robturnT": "Взяв эти кости, робот решил продолжить ход",
    "15_01_robrurnF": "Взяв эти кости, робот решил закончить ход",
    "16_won": "ПОЗДРАВЛЯЮ, %s!. ТЫ ПОБЕДИЛ!",
    "17_gmend": "Game was alrady en",
    "18_actchoose": """1 - продолжить ход, 2 - закончить ход,
                    0 - выбрать другие кости""",
    "19_badans": "Неправильный ответ",
    "20_dicechoose": "Выберите кости",
    "21_robthink": "Робот думает",
    "22_dontans":
                """Хорошо, можете не отвечать. %p Тогда я буду
                называть вас 'Человек'""",
    "25_badname": """Простите, но ваше имя не подходит. %p
                  выберете что-то другое""",
    "26_badalldice": "Никакие кости не принесли очков"
}

ASCII_DICES = {
    0: ["       ", "       ", "       ", "       "],
    1: ["       ", "│     │", "│  ●  │", "│     │"],
    2: ["       ", "│    ●│", "│     │", "│●    │"],
    3: ["       ", "│●    │", "│  ●  │", "│    ●│"],
    4: ["       ", "│●   ●│", "│     │", "│●   ●│"],
    5: ["       ", "│●   ●│", "│  ●  │", "│●   ●│"],
    6: ["       ", "│●   ●│", "│●   ●│", "│●   ●│"]
}

KEYCODES = {
    "t_continue": "1",
    "t_end": "2",
    "t_cancel": "0",
}
