"""Логово данных."""

#  8888888b.         d8888 88888888888     d8888
#  888  "Y88b       d88888     888        d88888
#  888    888      d88P888     888       d88P888
#  888    888     d88P 888     888      d88P 888
#  888    888    d88P  888     888     d88P  888
#  888    888   d88P   888     888    d88P   888
#  888  .d88P  d8888888888     888   d8888888888
#  8888888P"  d88P     888     888  d88P     888


MSG_REGISTRY = {
    # Приветствие и установка параметров
    "01_hello": "Добро пожаловать в игру! %p Я буду вашим ведущим",
    "02_0_getname": "Как вас зовут?",
    "02_1_badname": """Простите, но ваше имя не подходит. %p
                  Выберете что-то другое""",
    "02_2_stdname": """Хорошо, можете не отвечать. %p Тогда я буду
                     называть вас 'Человек'""",
    "03_robhello": """Приятно познакомиться, %s. %p Ваш противник
                   - робот по имени %s""",
    "04_0_gethbar": """Теперь введите максимальное число очков. %p Победит
                  тот, кто наберет столько же или больше""",
    "04_1_getaehbar": "Ведите максимальное число очков",
    "04_2_errint": "Нужно число",
    "04_3_badval": "Плохая идея. %p Я рекомендую выбрать 2000",
    "05_gamestart": "Великолепно! %p Начинаем игру!",
    # Действие
    "06_whoturn": "%s ходит",
    "07_nocombos": "Нет ни одной комбинации! %p Все очки за ход сгорают!",
    "08_0_getpick": "Выберите кости",
    "08_1_errpick": "Таких костей нет!",
    "09_0_scrtrun": "%s зарабатывает за ход %s очков",
    "09_1_scrtotl": "%s всего заработал %s очков",
    "09_2_scrpick": "%s зарабатывает %s очков",
    "10_0_badpick": "Некоторые кости не принесли вам очки",
    "10_1_badallpick": "%s, %p никакие кости не приносят очков!",
    "11_robthink": "Робот думает",
    "12_0_robturnT": "Робот решил ПРОДОЛЖИТЬ ход, взяв эти кости",
    "12_1_robturnF": "Робот решил ЗАКОНЧИТЬ ход, взяв эти кости",
    "13_0_actchoose": """1 - продолжить ход %n 2 - закончить ход %n
                      0 - выбрать другие кости""",
    "13_1_badans": "Неправильный ответ",
    # Концовка
    "14_won": "Поздравляю, %s! %p Это победа!",
    "15_gameend": "Игра окончена. %p Я покидаю это окно",
    # Дебаг
    "debug": "%s"
}

ASCII_DICES = {
    0: ["       ", "       ", "       ", "       "],
    1: ["       ", "│     │", "│  ●  │", "│     │"],
    2: ["       ", "│    ●│", "│     │", "│●    │"],
    3: ["       ", "│●    │", "│  ●  │", "│    ●│"],
    4: ["       ", "│●   ●│", "│     │", "│●   ●│"],
    5: ["       ", "│●   ●│", "│  ●  │", "│●   ●│"],
    6: ["       ", "│●   ●│", "│●   ●│", "│●   ●│"]
}

KEYCODES = {
    "TURN_CONTINUE": "1",
    "TURN_END": "2",
    "TURN_CANCEL": "0",
}

TIMINGS = {
    # Задержка сообщений
    "DELAY-LNG": 3,
    "DELAY-MID": 2.5,
    "DELAY-STD": 2,
    "DELAY-FST": 1.5,
    "DELAY-ERR": 1,
    # Печать сообщений
    "PRINT-CHR": 0.027,
    "PRINT-PAU": 0.5
}


DICES_CLEAR_COMBOS = {
    1: ([1], [5]),

    2: ([1, 1], [1, 5], [5, 5]),

    3: ([1, 1, 1], [1, 1, 5], [1, 5, 5],
        [2, 2, 2], [3, 3, 3], [4, 4, 4],
        [5, 5, 5], [6, 6, 6]),

    4: ([1, 1, 1, 1], [1, 1, 1, 5], [1, 1, 5, 5],
        [1, 2, 2, 2], [1, 3, 3, 3], [1, 4, 4, 4],
        [1, 5, 5, 5], [1, 6, 6, 6], [2, 2, 2, 2],
        [2, 2, 2, 5], [3, 3, 3, 3], [3, 3, 3, 5],
        [4, 4, 4, 4], [4, 4, 4, 5], [5, 5, 5, 5],
        [5, 6, 6, 6], [6, 6, 6, 6]),

    5: ([1, 1, 1, 1, 1], [1, 1, 1, 1, 5], [1, 1, 1, 5, 5],
        [1, 1, 2, 2, 2], [1, 1, 3, 3, 3], [1, 1, 4, 4, 4],
        [1, 1, 5, 5, 5], [1, 1, 6, 6, 6], [1, 2, 2, 2, 2],
        [1, 2, 2, 2, 5], [1, 2, 3, 4, 5], [1, 3, 3, 3, 3],
        [1, 3, 3, 3, 5], [1, 4, 4, 4, 4], [1, 4, 4, 4, 5],
        [1, 5, 5, 5, 5], [1, 5, 6, 6, 6], [1, 6, 6, 6, 6],
        [2, 2, 2, 2, 2], [2, 2, 2, 2, 5], [2, 2, 2, 5, 5],
        [3, 3, 3, 3, 3], [3, 3, 3, 3, 5], [3, 3, 3, 5, 5],
        [4, 4, 4, 4, 4], [4, 4, 4, 4, 5], [4, 4, 4, 5, 5],
        [5, 5, 5, 5, 5], [5, 5, 6, 6, 6], [5, 6, 6, 6, 6],
        [6, 6, 6, 6, 6]),

    6: ([1, 1, 1, 1, 1, 1], [1, 1, 1, 1, 1, 5], [1, 1, 1, 1, 5, 5],
        [1, 1, 1, 2, 2, 2], [1, 1, 1, 3, 3, 3], [1, 1, 1, 4, 4, 4],
        [1, 1, 1, 5, 5, 5], [1, 1, 1, 6, 6, 6], [1, 1, 2, 2, 2, 2],
        [1, 1, 2, 2, 2, 5], [1, 1, 2, 3, 4, 5], [1, 1, 3, 3, 3, 3],
        [1, 1, 3, 3, 3, 5], [1, 1, 4, 4, 4, 4], [1, 1, 4, 4, 4, 5],
        [1, 1, 5, 5, 5, 5], [1, 1, 5, 6, 6, 6], [1, 1, 6, 6, 6, 6],
        [1, 2, 2, 2, 2, 2], [1, 2, 2, 2, 2, 5], [1, 2, 2, 2, 5, 5],
        [1, 2, 3, 4, 5, 5], [1, 2, 3, 4, 5, 6], [1, 3, 3, 3, 3, 3],
        [1, 3, 3, 3, 3, 5], [1, 3, 3, 3, 5, 5], [1, 4, 4, 4, 4, 4],
        [1, 4, 4, 4, 4, 5], [1, 4, 4, 4, 5, 5], [1, 5, 5, 5, 5, 5],
        [1, 5, 5, 6, 6, 6], [1, 5, 6, 6, 6, 6], [1, 6, 6, 6, 6, 6],
        [2, 2, 2, 2, 2, 2], [2, 2, 2, 2, 2, 5], [2, 2, 2, 2, 5, 5],
        [2, 2, 2, 3, 3, 3], [2, 2, 2, 4, 4, 4], [2, 2, 2, 5, 5, 5],
        [2, 2, 2, 6, 6, 6], [3, 3, 3, 3, 3, 3], [3, 3, 3, 3, 3, 5],
        [3, 3, 3, 3, 5, 5], [3, 3, 3, 4, 4, 4], [3, 3, 3, 5, 5, 5],
        [3, 3, 3, 6, 6, 6], [4, 4, 4, 4, 4, 4], [4, 4, 4, 4, 4, 5],
        [4, 4, 4, 4, 5, 5], [4, 4, 4, 5, 5, 5], [4, 4, 4, 6, 6, 6],
        [5, 5, 5, 5, 5, 5], [5, 5, 5, 6, 6, 6], [5, 5, 6, 6, 6, 6],
        [5, 6, 6, 6, 6, 6], [6, 6, 6, 6, 6, 6])
}


PLAYER_NAME = "Human"
